In [4]:
print('Inteligência Aritificial')

Inteligência Aritificial

In [5]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in c:\users\dsadm\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
import pandas as pd

In [7]:
Dicionario ={"A":[1,2,3,4],
             "B":[5,6,7,8],
             "C":[9,10,11,12]}
LABELS=["1 linha", "2 linha", "3 linha", "4 linha"]

dados  = pd.DataFrame(Dicionario,index= LABELS)

dados.head() #exibe as 4 primeiras linhas da base de dados

         A  B   C
1 linha  1  5   9
2 linha  2  6  10
3 linha  3  7  11
4 linha  4  8  12

In [8]:
dados.head(2) # exibe as 2 primeiras linhas da base de dados

         A  B   C
1 linha  1  5   9
2 linha  2  6  10

In [9]:
dados.tail(4) # exibe as 4 últimas linhas da dataframe

         A  B   C
1 linha  1  5   9
2 linha  2  6  10
3 linha  3  7  11
4 linha  4  8  12

In [10]:
dados.describe() #inofrmaçõe estatísticas dos dados

              A         B          C
count  4.000000  4.000000   4.000000
mean   2.500000  6.500000  10.500000
std    1.290994  1.290994   1.290994
min    1.000000  5.000000   9.000000
25%    1.750000  5.750000   9.750000
50%    2.500000  6.500000  10.500000
75%    3.250000  7.250000  11.250000
max    4.000000  8.000000  12.000000

In [11]:
dados.info() #descreve informações sobre os dados

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1 linha to 4 linha
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [12]:
dados['D']= dados['B']*dados['C'] #multiplicação de colunas do Dataframe (DT)

In [13]:
dados.head()

         A  B   C   D
1 linha  1  5   9  45
2 linha  2  6  10  60
3 linha  3  7  11  77
4 linha  4  8  12  96

In [14]:
dados.drop('B', axis=1, inplace=True) #Exclui a coluna B
#O implace permite a exclusão de uma coluna na base de dados original

In [15]:
dados.head()

         A   C   D
1 linha  1   9  45
2 linha  2  10  60
3 linha  3  11  77
4 linha  4  12  96

In [16]:
dados.loc["3 linha"] # localiza uma linha

A     3
C    11
D    77
Name: 3 linha, dtype: int64

In [17]:
dados.loc[["3 linha", "2 linha"], ["A", "C"]] # busca mais de uma linha e coluna do DT

         A   C
3 linha  3  11
2 linha  2  10

In [18]:
dados.iloc[0:2] # iloc é para exibir as linhas a partir do índice posição

         A   C   D
1 linha  1   9  45
2 linha  2  10  60

In [19]:
dados.iloc[0:2,0:2]

         A   C
1 linha  1   9
2 linha  2  10

In [20]:
dados['A']>0

1 linha    True
2 linha    True
3 linha    True
4 linha    True
Name: A, dtype: bool

In [21]:
FILTRO = dados['A'] >0 #armazena o resultado na variavel filtro

In [22]:
FILTRO

1 linha    True
2 linha    True
3 linha    True
4 linha    True
Name: A, dtype: bool

In [23]:
dados['FILTRO']= FILTRO # armazena o filtro nessa base de dados

In [24]:
dados.head()

         A   C   D  FILTRO
1 linha  1   9  45    True
2 linha  2  10  60    True
3 linha  3  11  77    True
4 linha  4  12  96    True

In [25]:
dados[(dados['A']>=2)& (dados['C'] >2)]

         A   C   D  FILTRO
2 linha  2  10  60    True
3 linha  3  11  77    True
4 linha  4  12  96    True

In [26]:
dados.reset_index()

     index  A   C   D  FILTRO
0  1 linha  1   9  45    True
1  2 linha  2  10  60    True
2  3 linha  3  11  77    True
3  4 linha  4  12  96    True

In [27]:
dados.set_index('C') # altera o index do DT

    A   D  FILTRO
C
9   1  45    True
10  2  60    True
11  3  77    True
12  4  96    True

In [28]:
Dicionario_1={
    'A' :[10,20,30,40],
    'B' :[50,60,70,80],
    'C' :[90,100,110,120],
    'Chaves' :['AA','BB','CC','DD']
}
Dicionario_2={
    'A' :[5,10,15,20],
    'B' :[35,70,105,140],
    'C' :[100,200,300,400],
    'Chaves' :['AA','BB','CC','DD']
}
Dicionario_3={
    'A' :[-10,-20,-30,-40],
    'B' :[25,50,75,100],
    'C' :[90,100,110,120],
    'Chaves' :['AA','BB','CC','DD']
}
Labels_1=['1 linha','2 linha','3 linha','4 linha']
Labels_2=['5 linha','6 linha','7 linha','8 linha']
Labels_3=['9 linha', '10 linha','11 linha','12 linha']
          
df1 = pd.DataFrame(Dicionario_1, index=Labels_1)
df2 = pd.DataFrame(Dicionario_2, index=Labels_2)
df3 = pd.DataFrame(Dicionario_3, index=Labels_3)

dados_df = pd.concat([df1,df2,df3]) # junta os dataframes desde que todos tenham a mesma estrutura

In [29]:
dados_df.head(10) # exibe o dataframe unificado

           A    B    C Chaves
1 linha   10   50   90     AA
2 linha   20   60  100     BB
3 linha   30   70  110     CC
4 linha   40   80  120     DD
5 linha    5   35  100     AA
6 linha   10   70  200     BB
7 linha   15  105  300     CC
8 linha   20  140  400     DD
9 linha  -10   25   90     AA
10 linha -20   50  100     BB

In [30]:
df_n = pd.merge(df1,df2,how='inner', on='Chaves') # une o dataframe a partir da semelhança das chaves nas colunas

In [31]:
df_l = pd.merge(df1,df2,how='left', on='Chaves') # une o dataframe a partir da semelhança das chaves nas colunas

In [32]:
df_l.head()

   A_x  B_x  C_x Chaves  A_y  B_y  C_y
0   10   50   90     AA    5   35  100
1   20   60  100     BB   10   70  200
2   30   70  110     CC   15  105  300
3   40   80  120     DD   20  140  400

In [37]:
Dicionario_1={
    'A' :[10,20,30,40],
    'B' :[50,60,70,80],
    'C' :[90,100,110,120],

}
Dicionario_3={
    'D' :[30,20,50,40],
    'E' :[1,2,3,4],
    'F' :[7,8,9,10],

}
Labels_n=['1ª linha','2ª linha','3ª linha', '4ª linha']

DataFrame1 = pd.DataFrame(Dicionario_1,index=Labels_n)
DataFrame3 = pd.DataFrame(Dicionario_3,index=Labels_n)

In [39]:
DataFrame1.join(DataFrame3)

           A   B    C   D  E   F
1ª linha  10  50   90  30  1   7
2ª linha  20  60  100  20  2   8
3ª linha  30  70  110  50  3   9
4ª linha  40  80  120  40  4  10